//Failure Reason:

//%%2305	The specified user account has expired. 
//%%2309	The specified account's password has expired. 
//%%2310	Account currently disabled. 
//%%2311	Account logon time restriction violation. 
//%%2312	User not allowed to logon at this computer. 
//%%2313	Unknown user name or bad password

SecurityEvent
| where EventID == 4625 and FailureReason == "%%2313"
| summarize count() by Account
//| summarize count() by Ipaddress
