//Malicious traffic on DNS servers
DnsInventory
| where SubType == "Server"
| project Computer, DomainName, ForestName, ServerIPs


//List of DNS Zones
DnsInventory
| where SubType == 'Zone'
| project ZoneName, DynamicUpdate, NameServers, DnsSecSigned


//Unused Resource Records
DnsInventory
| where SubType == 'ResourceRecord' and ResourceRecordName !in ((DnsEvents
    | where SubType == 'LookupQuery'
    | distinct Name))
    

//Configuration Events
DnsEvents
| where SubType == 'ConfigurationChange'
| project EventId, TimeGenerated, Computer, TaskCategory, Message

//DNS Analytical Log
DnsEvents
| where SubType == 'LookupQuery'

