//4724 – password reset attempt by administrator and 
//4723 – password change attempt by user

SecurityEvent
| where EventID == 4724 or EventID == 4723
| summarize count() by Account, Computer, SubjectAccount, SubjectUserName, TargetAccount, TargetUserName
